import "@fontsource/montserrat";
import "./App.css";
import styled from "styled-components";
import { Col, Row, Divider, Typography, Avatar, Image, Card } from "antd";
import TransparentBoxText from "./components/TransparentBoxText";
import Header from "./components/Header";
import { FaInstagram } from "react-icons/fa";

const { Paragraph } = Typography;

const Aaa = styled.div`
  background-image: url("data:image/svg+xml;charset=utf-8,%3Csvg version='1.1' id='Layer_1' xmlns='http://www.w3.org/2000/svg' x='0' y='0' viewBox='0 0 386.7 27.8' xml:space='preserve'%3E%3Cstyle%3E.st0{fill:%23fff}%3C/style%3E%3Cpath class='st0' d='M34.1 27.3h-8.8L32.1.6h14.7c5.4 0 12 1.2 10.6 6.9-1 4-5.2 6.1-9.8 6.5v.2c5.6.1 6.1 2.5 5.6 6.7-.3 2.2-.4 4.3-.2 6.5h-9.6c0-1.8.2-3.8.5-5.7.5-3.2.6-4.5-3.9-4.5h-3.3l-2.6 10.1zm7.4-15.4c2.8 0 5.6-.3 6.3-3.1.7-2.7-2-3.1-4.8-3.1h-3.4L38 11.9h3.5zM53.7 27.3L73 .6h10.8l5.8 26.7h-10l-.8-5.2H65.9l-3.4 5.2h-8.8zM78 16.9L76.7 5.8h-.1l-7.1 11.1H78zM91.6 27.3L98.4.6h8.8l-6.8 26.7h-8.8zM110.9.6h12.4l5.6 19.9.1-.1 5-19.8h7.9l-6.8 26.7H123l-5.6-20.5h-.1l-5.2 20.5h-7.9L110.9.6zM139 27.3L145.8.6h8.8l-6.8 26.7H139zM158.4.6h12.4l5.6 19.9.1-.1 5-19.8h7.9l-6.8 26.7h-12.2l-5.6-20.5h-.1l-5.2 20.5h-7.9L158.4.6zM211.6 17.3h-6.5l1.3-5.2h15.3l-3.6 14.3c-7.4.9-8.9 1.5-16.5 1.5-9.9-.3-14.6-5.6-12.5-13.9C191.2 5.6 198.6.4 208.6.1c7.8-.2 15.6.8 13.8 8.5h-8.8c.2-2.6-2-3.4-4.9-3.4-5.9 0-9.2 4.4-10.3 8.7-1.3 5.3.9 8.7 7.3 8.7 1.6 0 3.3-.2 4.7-.4l1.2-4.9zM221.7 27.3L228.5.6h14.7c7.8 0 12.4 2.1 10.8 8.6-1.6 6.5-7.3 8.6-15.1 8.6H233l-2.4 9.5h-8.9zm17.1-14.7c3.5-.1 5.3-1.4 5.8-3.4s-.6-3.3-4.1-3.4H236l-1.7 6.8h4.5zM251.9 27.3L258.7.6H283l-1.3 5.2h-15.4l-1.4 5.5H279l-1.3 5.2h-14.2l-1.4 5.7h15.5l-1.3 5.2h-24.4zM277.5 27.3L296.9.6h10.8l5.8 26.7h-10l-.8-5.2h-12.9l-3.4 5.2h-8.9zm24.3-10.4l-1.2-11.1h-.1l-7.1 11.1h8.4zM340.7.6h10.5l-14 11.8 8.1 14.9h-10.9l-6.9-14.2h-.1l-3.6 14.2H315L321.8.6h8.8l-3 11.7h.1l13-11.7z'/%3E%3Cpath class='st0' d='M366.2 8.4c.3-1 .1-1.8-.5-2.4-.6-.6-1.7-.8-3.2-.8-2 0-4.1 1.1-4.4 2.4-.5 2 2.2 2.6 4.4 3.1 5 1.1 12.7 1.6 10.9 8.8-1.4 5.6-8.7 8.3-16.1 8.3-7.4 0-13.5-1.8-11.8-9.1h8.8c-.7 2.5 1.2 3.9 4.4 3.9 2 0 4.9-.9 5.3-2.7.9-3.6-5.8-2.8-12.1-5.4-2.9-1.2-3.9-3.6-3.2-6.5 2-6.3 9-8.1 15.7-8.1 6.6 0 12.8 2 10.7 8.4h-8.9zM0 5.8L1.3.6h28.6l-1.3 5.2h-9.5l-5.5 21.5H4.8l5.4-21.5z'/%3E%3Cg%3E%3Cpath class='st0' d='M380.8 1.3h-1.4l-.8 3h-1l.8-3H377l.2-.7h3.8l-.2.7zm5 3h-1l.8-3-2.1 3h-.6l-.5-3-.8 3h-1l.9-3.7h1.6l.4 2.2L385 .6h1.6l-.8 3.7z'/%3E%3C/g%3E%3C/svg%3E");
`;

function App() {
  return (
    <>
      <Header />
      <TransparentBoxText text={"Твій тренувальний план"} />
      <Divider />
      <Row justify="center" gutter={16}>
        <Col span={4} className="gutter-row">
          <Image src={"./polina.jpg"} style={{ borderRadius: "50%" }} preview={false} />
          {/* <Avatar src={"./polina.jpg"} size={"100%"}/> */}
        </Col>
        <Col span={8} className="gutter-row">
          <Typography.Title level={2} style={{ margin: 0, paddingBottom: "4vh" }}>
            Я тренер Поліна Захарова.
          </Typography.Title>
          <Typography.Text>
            Я майстер спорту міжнародного класу з Рогейну, майстер спорту
            України з легкої атлетики, чемпіонка і призерка Чемпіонатів Світу та
            Європи з Рогейну. Також, я тренер з трейлового бігу. Чим я живу
            можна подивитись в інстаграмі <FaInstagram />, але через кляту русню
            останній рік не наповлений постами.

            UTMB – https://utmb.world/runner/2176979.polina.zakharova
          </Typography.Text>
        </Col>
      </Row>
      <Image src="./ski2.jpg" preview={false} style={{ marginTop: "3vh", marginBottom: "3hv" }}/>
      <Row justify="space-around">
        <Col span={10}>
          <Image src="./polina2.jpg" preview={false}/>
        </Col>
        <Col span={10}>
          <Typography.Text>
            Якщо тебе цікавить щось з цього списку:
            <ul>
              <li>План підготовки до старту (щотижневий)</li>
              <li>План підготовки до старту + супорт на старті</li>
              <li>Групові тренування (контроль, мотивація, допомога)</li>
              <li>Персональні тренування</li>
              <li>
                Збори: навчально-тренувальні, загально-підготовчі,
                спеціально-підготовчі
              </li>
              <li>Стратегія гонки</li>
              <li>Глобальну переодизацію до твого старту</li>
            </ul>
            Напиши мені вже сьогодні, і, можливо, нам з тобою по дорозі. Зі мною
            можна домовитись.
          </Typography.Text>
        </Col>
      </Row>
      <Divider />
      <Row>
        <Col span={22} gutter={-2}>
          <Typography.Title
            level={2}
            style={{ margin: 0, textAlign: "center" }}
          >
            Якщо в тебе є крейзі-кардіо думка, є шанс, що ми зрозуміємо тебе і
            допоможемо її реалізувати.
          </Typography.Title>
          <Paragraph></Paragraph>
        </Col>
      </Row>
      <Divider />
      <Row>
        <Col>
        {/* <Card 
        style={{ width: '100%', height: '100%', background: 'red', box-sizing:  'border-box'}}
        headStyle={{ backgroundColor: '#E6ECF0' }}
        bodyStyle={{padding: '5px'}}
        type="inner">
        <div style={{height: '100%', width: '100%'}}></div>
          </Card> */}
        </Col>
      </Row>
      <Row>
        <Col span={8}>
        <Card title="Щомісячний персональний план - 25 євро" size="big">
        <p>Даний пакет, найкраще підійде
          для тих, хто має біговий досвід та готуватися до стартів “з метою
          активно провести час, не схлопотать травм на рівному місці і звичайно
          - зробити гарні фото”. У цьому пакеті ви отримаєте: унікальний
          тренувальний план раз на місяць. “акаунт/безкоштовний акаунт” в
          TRAININGPEAKS; допомогу з вибором старту та підготовку до старту;
          зворотній зв”язок тренера раз на місяць через додаток TRAININGPEAKS.</p>
      
          </Card>
        </Col>
        <Col span={8}>
          Щотижневий персональний план - 40 євро Саме ций пакет послуг, найкраще
          підійде для бігунів, які люблять готуватись, чи вперше готуються до
          Trail, Ultra-trail, Sky race та OCR від 5 до 80 км або довше. У цьому
          пакеті ви отримаєте: унікальний тренувальний план раз на тиждень, який
          адаптується до особистих, сімейних і професійних потреб;
          “акаунт/безкоштовний акаунт” в TRAININGPEAKS; допомогу з вибором
          стартів та підготовку до стартів; аналіз 1 прийдешньої гонки та розбір
          майбутнього старту класу А; рекомендації щодо харчування під час
          гонки; зворотній зв”язок тренера раз на тиждень через додаток
          TRAININGPEAKS. відеозустріч із тренером раз на місяць.
        </Col>
        <Col span={8}>
          Елітний план - 60 євро Ідеально підходить для елітних бігунів або дуже
          амбітних бігунів, які люблять готуватися до Trail, Ultra-trail, Sky
          race та OCR від 5 до 150 км або довше. У цьому пакеті ви отримаєте:
          унікальний тренувальний план раз на тиждень, який адаптується до
          особистих, сімейних і професійних потреб; преміум акаунт в
          TRAININGPEAKS; допомогу з вибором стартів та підготовку до стартів;
          аналіз … кількості пройдешніх та майбутніх перегонів; рекомендації
          щодо харчування під час гонки; зворотній зв”язок тренера тричі на
          тиждень через додаток TRAININGPEAKS. відеозустріч із тренером раз на
          тиждень.
        </Col>
      </Row>
    </>
  );
}

export default App;
